<details ><summary>plan for fundaztic 2025-08-11 09:39:13 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#fundaztic has been locked by PR #3
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic will be created
  + resource "oci_artifacts_container_repository" "fundaztic" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>